# SQL.

In [1]:
import sqlite3
from sqlite3 import Error
import pandas as pd
import datetime as dt

In [2]:
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        return conn
    except Error as e:
        print(e)

    return conn

In [3]:
def create_table(conn, create_table_sql):
    """ create a table from the create_table_sql statement
    :param conn: Connection object
    :param create_table_sql: a CREATE TABLE statement
    :return:
    """
    try:
        c = conn.cursor()
        c.execute(create_table_sql)
    except Error as e:
        print(e)

In [4]:
db = 'e_database.sqlite'
conn = create_connection(db)

In [5]:
create_table1 = """ CREATE TABLE IF NOT EXISTS transactions (id integer PRIMARY KEY,
user_id integer NOT NULL,
created_at datetime NOT NULL,
product_id integer NOT NULL,
quantity integer NOT NULL
);"""

In [6]:
#create_table(conn, create_table1)

In [7]:
df = pd.read_csv('./data/transaction1.csv')

In [8]:
df

,id,user_id,created_at,product_id,quantity,Unnamed: 5,Unnamed: 6
0,40001563,56667,01/01/2021,100010002,2,NaN,NaN
1,40001650,60001,01/01/2021,100010002,3,NaN,NaN
2,40001737,56667,01/01/2021,100010002,4,NaN,NaN
3,40001824,77701,01/01/2021,100010002,5,NaN,NaN
4,40001911,56667,01/01/2021,500130300,6,NaN,NaN
5,40001998,80991,01/01/2021,500130300,7,NaN,NaN
6,40002085,77701,01/01/2021,500130300,8,NaN,NaN
7,40002172,56667,01/01/2021,200200100,9,NaN,NaN
8,40002259,60001,01/02/2021,500130300,10,NaN,NaN
9,40002346,77701,01/03/2021,150150300,11,NaN,NaN
10,40002433,80991,01/04/2021,150150300,12,NaN,NaN
11,40002520,56667,01/05/2021,100010002,2,NaN,NaN
12,40002607,65534,01/06/2021,100010002,3,NaN,NaN
13,40002694,60001,01/06/2021,100010002,4,NaN,NaN
14,40001563,65534,01/06/2021,100010002,5,NaN,NaN
15,40001650,56754,01/06/2021,300300111,6,NaN,NaN
16,40001737,80991,01/10/2021,300300111,2,NaN,NaN
17,40001824,60001,01/11/2021,300300111,3,NaN,NaN
18,40001911,56667,01/12/2021,200200100,4,NaN,NaN
19,40001998,56754,01/10/2021,500130300,5,NaN,NaN
20,40002085,80991,01/10/2021,200200100,6,NaN,NaN
21,40002172,77701,01/10/2021,150150300,2,NaN,NaN
22,40002259,80991,01/16/2021,150150300,3,NaN,NaN
23,40002346,67001,01/17/2021,150150300,4,NaN,NaN
24,40002433,77701,01/18/2021,400601505,5,NaN,NaN
25,40002520,56667,01/19/2021,400601505,6,NaN,NaN
26,40002607,77701,01/20/2021,100010002,2,NaN,NaN
27,40002694,80991,01/21/2021,100010002,3,NaN,NaN
28,40001563,50077,01/22/2021,100010002,4,NaN,NaN
29,40001650,60001,01/22/2021,100010002,5,NaN,NaN
30,40001737,56667,01/22/2021,200200100,6,NaN,NaN
31,40001824,50077,01/22/2021,500130300,2,NaN,NaN
32,40001911,77701,01/22/2021,300300111,3,NaN,NaN
33,40001998,67001,01/27/2021,300300111,4,NaN,NaN
34,40002085,56667,01/30/2021,300300111,5,NaN,NaN
35,40002172,67001,01/30/2021,200200100,6,NaN,NaN
36,40002259,80991,01/30/2021,500130300,2,NaN,NaN
37,40002346,60001,02/03/2021,200200100,3,NaN,NaN
38,40002433,50077,02/03/2021,200200100,4,NaN,NaN
39,40002520,77701,02/03/2021,300300111,5,NaN,NaN
40,40002607,77701,02/03/2021,300300111,6,NaN,NaN
41,40002694,60001,02/03/2021,300300111,4,NaN,NaN

In [9]:
df = df.drop('Unnamed: 5', axis=1)

In [10]:
df = df.drop('Unnamed: 6', axis=1)

In [11]:
df.head(4)

         id  user_id  created_at  product_id  quantity
0  40001563    56667  01/01/2021   100010002         2
1  40001650    60001  01/01/2021   100010002         3
2  40001737    56667  01/01/2021   100010002         4
3  40001824    77701  01/01/2021   100010002         5

In [12]:
df.to_sql('transaction1', conn)

In [13]:
for row in conn.execute("SELECT * FROM sqlite_master;"):
    print(row)

('table', 'transaction1', 'transaction1', 2, 'CREATE TABLE "transaction1" (\n"index" INTEGER,\n  "id" INTEGER,\n  "user_id" INTEGER,\n  "created_at" TEXT,\n  "product_id" INTEGER,\n  "quantity" INTEGER\n)')
('index', 'ix_transaction1_index', 'transaction1', 3, 'CREATE INDEX "ix_transaction1_index"ON "transaction1" ("index")')

In [14]:
q = """
SELECT user_id, created_at, product_id, quantity
FROM 
(SELECT user_id, created_at, product_id, quantity, RANK() OVER (
PARTITION BY user_id
ORDER BY created_at ASC
) AS rank_value
FROM transaction1
) AS t
WHERE rank_value = 3;
"""

In [15]:
c = conn.cursor()
c.execute(q)

In [16]:
c.fetchall()

[(50077, '02/03/2021', 200200100, 4),
 (60001, '01/06/2021', 100010002, 4),
 (67001, '01/30/2021', 200200100, 6),
 (77701, '01/03/2021', 150150300, 11),
 (80991, '01/10/2021', 300300111, 2),
 (80991, '01/10/2021', 200200100, 6)]

In [17]:
q1 = """SELECT user_id, created_at, product_id, quantity, RANK() OVER (
PARTITION BY user_id
ORDER BY created_at ASC
) AS rank_value
FROM transaction1
ORDER BY rank_value"""

In [18]:
c = conn.cursor()
c.execute(q1)
c.fetchall()

[(50077, '01/22/2021', 100010002, 4, 1),
 (50077, '01/22/2021', 500130300, 2, 1),
 (56667, '01/01/2021', 100010002, 2, 1),
 (56667, '01/01/2021', 100010002, 4, 1),
 (56667, '01/01/2021', 500130300, 6, 1),
 (56667, '01/01/2021', 200200100, 9, 1),
 (56754, '01/06/2021', 300300111, 6, 1),
 (60001, '01/01/2021', 100010002, 3, 1),
 (65534, '01/06/2021', 100010002, 3, 1),
 (65534, '01/06/2021', 100010002, 5, 1),
 (67001, '01/17/2021', 150150300, 4, 1),
 (77701, '01/01/2021', 100010002, 5, 1),
 (77701, '01/01/2021', 500130300, 8, 1),
 (80991, '01/01/2021', 500130300, 7, 1),
 (56754, '01/10/2021', 500130300, 5, 2),
 (60001, '01/02/2021', 500130300, 10, 2),
 (67001, '01/27/2021', 300300111, 4, 2),
 (80991, '01/04/2021', 150150300, 12, 2),
 (50077, '02/03/2021', 200200100, 4, 3),
 (60001, '01/06/2021', 100010002, 4, 3),
 (67001, '01/30/2021', 200200100, 6, 3),
 (77701, '01/03/2021', 150150300, 11, 3),
 (80991, '01/10/2021', 300300111, 2, 3),
 (80991, '01/10/2021', 200200100, 6, 3),
 (60001, '01/11/2021', 300300111, 3, 4),
 (77701, '01/10/2021', 150150300, 2, 4),
 (56667, '01/05/2021', 100010002, 2, 5),
 (60001, '01/22/2021', 100010002, 5, 5),
 (77701, '01/18/2021', 400601505, 5, 5),
 (80991, '01/16/2021', 150150300, 3, 5),
 (56667, '01/12/2021', 200200100, 4, 6),
 (60001, '02/03/2021', 200200100, 3, 6),
 (60001, '02/03/2021', 300300111, 4, 6),
 (77701, '01/20/2021', 100010002, 2, 6),
 (80991, '01/21/2021', 100010002, 3, 6),
 (56667, '01/19/2021', 400601505, 6, 7),
 (77701, '01/22/2021', 300300111, 3, 7),
 (80991, '01/30/2021', 500130300, 2, 7),
 (56667, '01/22/2021', 200200100, 6, 8),
 (77701, '02/03/2021', 300300111, 5, 8),
 (77701, '02/03/2021', 300300111, 6, 8),
 (56667, '01/30/2021', 300300111, 5, 9)]

In [19]:
q2 = """SELECT user_id, created_at, product_id, quantity, DENse_RANK() OVER (
PARTITION BY user_id
ORDER BY created_at ASC
) AS rank_value
FROM transaction1
ORDER BY user_id"""

In [20]:
c = conn.cursor()
c.execute(q2)
c.fetchall()

[(50077, '01/22/2021', 100010002, 4, 1),
 (50077, '01/22/2021', 500130300, 2, 1),
 (50077, '02/03/2021', 200200100, 4, 2),
 (56667, '01/01/2021', 100010002, 2, 1),
 (56667, '01/01/2021', 100010002, 4, 1),
 (56667, '01/01/2021', 500130300, 6, 1),
 (56667, '01/01/2021', 200200100, 9, 1),
 (56667, '01/05/2021', 100010002, 2, 2),
 (56667, '01/12/2021', 200200100, 4, 3),
 (56667, '01/19/2021', 400601505, 6, 4),
 (56667, '01/22/2021', 200200100, 6, 5),
 (56667, '01/30/2021', 300300111, 5, 6),
 (56754, '01/06/2021', 300300111, 6, 1),
 (56754, '01/10/2021', 500130300, 5, 2),
 (60001, '01/01/2021', 100010002, 3, 1),
 (60001, '01/02/2021', 500130300, 10, 2),
 (60001, '01/06/2021', 100010002, 4, 3),
 (60001, '01/11/2021', 300300111, 3, 4),
 (60001, '01/22/2021', 100010002, 5, 5),
 (60001, '02/03/2021', 200200100, 3, 6),
 (60001, '02/03/2021', 300300111, 4, 6),
 (65534, '01/06/2021', 100010002, 3, 1),
 (65534, '01/06/2021', 100010002, 5, 1),
 (67001, '01/17/2021', 150150300, 4, 1),
 (67001, '01/27/2021', 300300111, 4, 2),
 (67001, '01/30/2021', 200200100, 6, 3),
 (77701, '01/01/2021', 100010002, 5, 1),
 (77701, '01/01/2021', 500130300, 8, 1),
 (77701, '01/03/2021', 150150300, 11, 2),
 (77701, '01/10/2021', 150150300, 2, 3),
 (77701, '01/18/2021', 400601505, 5, 4),
 (77701, '01/20/2021', 100010002, 2, 5),
 (77701, '01/22/2021', 300300111, 3, 6),
 (77701, '02/03/2021', 300300111, 5, 7),
 (77701, '02/03/2021', 300300111, 6, 7),
 (80991, '01/01/2021', 500130300, 7, 1),
 (80991, '01/04/2021', 150150300, 12, 2),
 (80991, '01/10/2021', 300300111, 2, 3),
 (80991, '01/10/2021', 200200100, 6, 3),
 (80991, '01/16/2021', 150150300, 3, 4),
 (80991, '01/21/2021', 100010002, 3, 5),
 (80991, '01/30/2021', 500130300, 2, 6)]

In [21]:
df1 = pd.read_csv('./data/tr1.csv')

In [22]:
df1.head(3)

   id  user_id  created_at  product_id  quantity
0   1     1001  01/02/2021   444113333         2
1   2     1001  01/03/2021   444113333         3
2   3     1001  01/04/2021   444113331         2

In [23]:
df1.to_sql('tr1', conn)

In [31]:
q3 = """SELECT id, user_id, created_at, product_id, quantity, 
ROW_NUMBER() OVER (PARTITION BY user_id ORDER BY created_at ASC),
RANK() OVER (PARTITION BY user_id ORDER BY created_at ASC),
DENSE_RANK() OVER (PARTITION BY user_id ORDER BY created_at ASC)
FROM tr1
ORDER BY user_id"""

In [32]:
c = conn.cursor()
c.execute(q3)
pd.DataFrame(c.fetchall(), columns= ['id','user_id', 'created_at', 'product_id', 'quantity', 'row_number', 'rank', 'dense_rank'])

,id,user_id,created_at,product_id,quantity,row_number,rank,dense_rank
0,1,1001,01/02/2021,444113333,2,1,1,1
1,2,1001,01/03/2021,444113333,3,2,2,2
2,3,1001,01/04/2021,444113331,2,3,3,3
3,4,1001,01/04/2021,444113332,6,4,3,3
4,5,1001,01/05/2021,444113331,2,5,5,4
5,6,1002,01/02/2021,555113333,2,1,1,1
6,7,1002,01/03/2021,555113333,3,2,2,2
7,8,1002,01/04/2021,555113334,2,3,3,3
8,9,1002,01/04/2021,555113340,6,4,3,3
9,10,1002,01/05/2021,555113338,2,5,5,4
10,11,1003,01/02/2021,444113333,2,1,1,1
11,12,1003,01/03/2021,444113333,3,2,2,2
12,13,1003,01/04/2021,444113331,2,3,3,3
13,14,1003,01/04/2021,444113332,6,4,3,3
14,15,1003,01/05/2021,444113331,2,5,5,4
15,16,1004,01/02/2021,444113333,2,1,1,1
16,17,1004,01/03/2021,444113333,3,2,2,2
17,18,1004,01/04/2021,444113331,2,3,3,3
18,19,1004,01/04/2021,444113332,6,4,3,3
19,20,1004,01/05/2021,444113331,2,5,5,4

In [33]:
q4 = """
SELECT user_id, created_at, product_id, quantity
FROM 
(SELECT user_id, created_at, product_id, quantity, RANK() OVER (
PARTITION BY user_id
ORDER BY created_at ASC
) AS rank_value
FROM tr1
) AS t
WHERE rank_value = 3;
"""

In [35]:
c = conn.cursor()
c.execute(q4)
pd.DataFrame(c.fetchall(), columns= ['user_id', 'created_at', 'product_id', 'quantity'])

   user_id  created_at  product_id  quantity
0     1001  01/04/2021   444113331         2
1     1001  01/04/2021   444113332         6
2     1002  01/04/2021   555113334         2
3     1002  01/04/2021   555113340         6
4     1003  01/04/2021   444113331         2
5     1003  01/04/2021   444113332         6
6     1004  01/04/2021   444113331         2
7     1004  01/04/2021   444113332         6